snlkuharlocal/src/Documents/Переоценка/Переоценка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Переоценка</name>
  <comment>Переоценка</comment>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Включать_Исключать_Склады</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПереоценки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереоценкаКДолларам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Брэнд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтарая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьСтарая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Склады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/InformationRegisters/История/История.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>История</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>CatalogRef.Декларация</types>
      <types>CatalogRef.Подразделения</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Контрагенты</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>4</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.ПунктыДоставки</types>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Договоры</types>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ВводОстатков</types>
      <types>DocumentRef.ВводОстатковТМЦ</types>
      <types>DocumentRef.Декларация</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.Переоценка</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/КодыОперацийОстатки/КодыОперацийОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийОстатки</name>
  <enumValues>
    <name>ВводОстатков</name>
  </enumValues>
  <enumValues>
    <name>Закупка</name>
    <comment>Закупка</comment>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
    <comment>Продажа</comment>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>Рекламация</comment>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
    <comment>Возврат от покупателя</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>Перемещение</comment>
  </enumValues>
  <enumValues>
    <name>Пересортица</name>
    <comment>Пересортица</comment>
  </enumValues>
  <enumValues>
    <name>Списание</name>
    <comment>Списание</comment>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
    <comment>Оприходование</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>Прочее</comment>
  </enumValues>
  <enumValues>
    <name>ЗакупкаР</name>
    <comment>Закупка (реальная)</comment>
  </enumValues>
  <enumValues>
    <name>Инвентаризация</name>
    <comment>Инвентаризация</comment>
  </enumValues>
  <enumValues>
    <name>Бонус</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
  <enumValues>
    <name>Комплектация</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеСертификата</name>
  </enumValues>
  <enumValues>
    <name>Переоценка</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
    <comment>Возврат поставщику</comment>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>АгентскийДоговор</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Переоценка/ObjectModule.bsl
Перем ПараметрыЗагрузки;

Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь)
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Возврат  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];		
		НаборЗаписей.Очистить();
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Функция ПолучитьОстаткиДляПереоценки()
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	Номенклатура,
	|	Цена КАК Цена
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	&Данные КАК Данные";
	Запрос.УстановитьПараметр("Данные",Товары);
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Номенклатура,
	|	СУММА(1) КАК КоличествоЦен,	
	|	СУММА(Цена) КАК Цена
	|ПОМЕСТИТЬ 
	|	Цены	
	|ИЗ
	|	Данные
	|СГРУППИРОВАТЬ ПО Номенклатура";
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Склад,
	|   Остатки.Номенклатура.Родитель КАК Модель,
	|	Остатки.Номенклатура	КАК Номенклатура,
	|	КоличествоОстаток 		КАК Остаток,
	|	СуммаОстаток 			КАК СтоимостьСтарая,
	|	IsNULL(КоличествоЦен,0) КАК КоличествоЦен,
	|	IsNULL(Цена,0) 			КАК Цена
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Остатки(&Дата1,"+?(Включать_Исключать_Склады="В"," ","НЕ ")+"Склад В (&Склады)"+?(ПереоценкаКДолларам,""," И Номенклатура В ИЕРАРХИИ (&Номенклатура)")+") КАК Остатки
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Цены
	|ПО 
	|	Остатки.Номенклатура.Родитель = Цены.Номенклатура
	|ГДЕ 
	|	КоличествоОстаток<>0";
	
	Запрос.УстановитьПараметр("Дата1",МоментВремени());
	Запрос.УстановитьПараметр("Склады",			Склады.ВыгрузитьКолонку("Склад"));
	Запрос.УстановитьПараметр("Номенклатура",	Товары.ВыгрузитьКолонку("Номенклатура"));
	
	ТО=Запрос.Выполнить().Выгрузить();
	ТО.Колонки.Добавить("СтоимостьНовая",ПолучитьОписаниеТиповЧисла(19,2));
	
	Возврат ТО;	
КонецФункции //

// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211
Процедура УстановитьБрэндТипТовара(СтрокаТЧ) Экспорт
	
	Номенклатура = СтрокаТЧ.Номенклатура;
	Если Номенклатура.Пустая() Тогда Возврат КонецЕсли; 
	
	Уровень = Номенклатура.Уровень();
	Если Уровень = 0 Тогда //ТипТовара
		СтрокаТЧ.ТипТовара	= Номенклатура;
		СтрокаТЧ.Брэнд	= Неопределено;
	ИначеЕсли Уровень = 1 Тогда //Брэнд
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура;
	ИначеЕсли Уровень = 2 Тогда //Модель		
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель;		
	ИначеЕсли Уровень = 3 Тогда //Позиция
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель.Родитель;
	ИначеЕсли Уровень = 4 Тогда
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель.Родитель.Родитель;
	ИначеЕсли Уровень = 5 Тогда
		СтрокаТЧ.ТипТовара	= Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель;
		СтрокаТЧ.Брэнд	= Номенклатура.Родитель.Родитель.Родитель.Родитель;
	Иначе //ХЗ
		СтрокаТЧ.ТипТовара	= Неопределено;
		СтрокаТЧ.Брэнд	= Неопределено;
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211

//СОБЫТИЯ ОБЪЕКТА
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	ЕстьИзменения	=Модифицированность();	
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
	МожноИзменятьДокумент(ЭтотОбъект,Отказ,Истина);		
		
	Если Отказ Тогда Возврат КонецЕсли;
	
	Если ЕстьИзменения Тогда
		ГруппыТоваров   	= ГруппыТоваровДокумента(ЭтотОбъект);
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	СостояниеНакладной	=Неопределено;
	Автор				=Неопределено;
	
	ДатаВыгрузки		=Неопределено;
КонецПроцедуры

// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	
	Если Основание = Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;		
	ДокОснование	= Основание;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание);
	
	///////////////////////////////////////////////////////////////////////////////////
	// Требуется возможность ввода ПРЦ на основании ПНК, заполняться номенклатурой
	// с видом номенклатуры, отличным от "товар", и суммой из ПНК по такой номенклатуре.
	///////////////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Количество КАК Количество,
	|	Товары.Цена КАК Цена,
	|	Товары.Сумма КАК Сумма,
	|	Товары.Всего КАК Всего,
	|	Товары.Цена КАК ЦенаСтарая,
	|	Товары.Сумма КАК СтоимостьСтарая
	|ИЗ
	|	Документ." + ВидОснования + ".Товары КАК Товары
	|ГДЕ
	|	(Товары.Номенклатура.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар)
	|	И Товары.Номенклатура.Родитель.ВидНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклаутры.Товар))
	|	И Товары.Ссылка = &Основание
	|";
	
	//|	Документ." + ВидОснования + ".Товары КАК Товары";
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Товары.Очистить();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		УстановитьБрэндТипТовара(НоваяСтрока);
	КонецЦикла;
	
КонецПроцедуры
// Шворобей ВЮ 03.12.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-1211

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ТО=ПолучитьОстаткиДляПереоценки();
	//крохин начало 15.05.2018
		//контроль остатков.
		Если ТО.количество() = 0 Тогда
			
		#Если Клиент Тогда
				Сообщить("ПРЦ: " +ЭтотОбъект.Номер + ". Нулевое количество переоцениваемого товара на остатках! Проведение документа невозможно!");
			Если Не(ПолучитьПолномочиеПользователя("СписыватьВМинус")) Тогда
               	Возврат;		   
			КонецЕсли;
		#КонецЕсли	
		КонецЕсли;
	//крохин конец 15.05.2018	
		//
	ВалютаУпр		=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);	
	КурсПереоценки	=ПолучитьКурсВалюты_ПоРусски(ПараметрыСеанса.ВалютаУпр_2009,Дата);
	
	Если ПереоценкаКДолларам Тогда
		Для Каждого СтрокаТЧ Из ТО Цикл
			СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая/КурсПереоценки;
		КонецЦикла;		
	ИначеЕсли ВидПереоценки="Сумма" Тогда
		СтоимостьНач=ТО.Итог("СтоимостьСтарая");
		//крохин начало 21.06.2011
		//случай нулевой стоимости
		КоличествоНач = ТО.Итог("Остаток");
		//крохин конец 21.06.2011
		
		СуммаКРаспределению=Окр(глПересчет(СуммаДокумента,Валюта,Курс,ВалютаУпр,Дата),2,1);	
		МаксСумма=0;
		МаксСтрока=Неопределено;
		
		Для Каждого СтрокаТЧ Из ТО Цикл
			Если СтрокаТЧ.СтоимостьСтарая>МаксСумма Тогда
				МаксСумма	=СтрокаТЧ.СтоимостьСтарая;		
				МаксСтрока	=СтрокаТЧ;
			КонецЕсли;
			//крохин начало 03.05.2011
			//деление на 0
			//СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая+СуммаКРаспределению*СтрокаТЧ.СтоимостьСтарая/СтоимостьНач;
			СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая+?(СтоимостьНач =0,0,СуммаКРаспределению*СтрокаТЧ.СтоимостьСтарая/СтоимостьНач);
			//крохин конец 03.05.2011
			//крохин начало 21.06.2011
			//случай нулевой стоимости всего товара
			Если Дата >= '20110701' И СтоимостьНач = 0 Тогда
			СтрокаТЧ.СтоимостьНовая=СтрокаТЧ.СтоимостьСтарая+?(КоличествоНач =0,0,СуммаКРаспределению*СтрокаТЧ.Остаток/КоличествоНач);	
			КонецЕсли;
			//крохин конец 21.06.2011
			
		КонецЦикла; 
		
		Дельта=СтоимостьНач+СуммаКРаспределению-ТО.Итог("СтоимостьНовая");
		Если Дельта<>0 Тогда
			Если МаксСтрока<>Неопределено Тогда
				МаксСтрока.СтоимостьНовая=МаксСтрока.СтоимостьНовая+Дельта;		
			КонецЕсли; 					
		КонецЕсли;	
	ИначеЕсли ВидПереоценки="Цены" Тогда
		ВалютаУпр	=?(Дата>='20090101',ПараметрыСеанса.ВалютаУпр_2009,ПараметрыСеанса.ВалютаУпр);
		Курс		=глПересчет(1,Валюта,Дата,ВалютаУпр,Дата,Ложь);
		
		Для Каждого СтрокаТЧ Из ТО Цикл
			Если СтрокаТЧ.КоличествоЦен<>0 Тогда
				СтрокаТЧ.СтоимостьНовая=Курс*СтрокаТЧ.Остаток*(СтрокаТЧ.Цена/СтрокаТЧ.КоличествоЦен);
			Иначе
				СтрокаТЧ.СтоимостьНовая=0;			
			КонецЕсли;		
		КонецЦикла;				
		СуммаДокумента=ТО.Итог("СтоимостьНовая")-ТО.Итог("СтоимостьСтарая");
		СуммаДокумента=глПересчет(СуммаДокумента,ПараметрыСеанса.ВалютаНац,Дата,Валюта,Курс);		
	КонецЕсли;	
	
	Для Каждого СтрокаТЧ Из ТО Цикл		
		Отклонение=СтрокаТЧ.СтоимостьНовая-СтрокаТЧ.СтоимостьСтарая;
		Если Отклонение=0 Тогда Продолжить КонецЕсли; 
		
		Движение=Движения.ОстаткиТМЦ.Добавить();	
		
		Движение.Период			= Дата;
		Движение.ВидДвижения	= ВидДвиженияНакопления.Расход;	
		
		Движение.Количество		= СтрокаТЧ.Остаток;
		
		Движение.Склад			= СтрокаТЧ.Склад;
		Движение.Номенклатура   = СтрокаТЧ.Номенклатура;
		
		Движение.Сумма			= СтрокаТЧ.СтоимостьСтарая;
		
		Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Переоценка;
		Движение.Отправитель	= СтрокаТЧ.Склад;
		
		
		Движение=Движения.ОстаткиТМЦ.Добавить();	
		
		Движение.Период			= Дата;
		Движение.ВидДвижения	= ВидДвиженияНакопления.Приход;	
		
		Движение.Количество		= СтрокаТЧ.Остаток;
		
		Движение.Склад			= СтрокаТЧ.Склад;
		Движение.Номенклатура   = СтрокаТЧ.Номенклатура;
		
		Движение.Сумма			= СтрокаТЧ.СтоимостьНовая;
		
		Движение.КодОперации	= Перечисления.КодыОперацийОстатки.Переоценка;
		Движение.Отправитель	= СтрокаТЧ.Склад;
	КонецЦикла;
	
	
	ТО.Свернуть("Модель","Остаток,СтоимостьСтарая,СтоимостьНовая");
	Для Каждого СтрокаТО Из ТО Цикл
		СтрокаТЧ=Товары.Найти(СтрокаТО.Модель,"Номенклатура");
		Если СтрокаТЧ<>Неопределено Тогда
			СтрокаТЧ.Количество=СтрокаТО.Остаток;			
			СтрокаТЧ.ЦенаСтарая		=?(СтрокаТО.Остаток<>0,СтрокаТО.СтоимостьСтарая/СтрокаТО.Остаток,0);
			СтрокаТЧ.СтоимостьСтарая=СтрокаТО.СтоимостьСтарая;
			СтрокаТЧ.Всего			=СтрокаТО.СтоимостьНовая;
		КонецЕсли;	
	КонецЦикла; 
	Записать();
	
	Доллары				=Справочники.Валюты.НайтиПоКоду("840");
	Рубли				=Справочники.Валюты.НайтиПоКоду("810");
	Евро				=Справочники.Валюты.НайтиПоКоду("978");
	
	СуммаРуб=глПересчет(СуммаДокумента,Валюта,Курс,Рубли,Дата);
	СуммаUSD=глПересчет(СуммаДокумента,Валюта,Курс,Доллары,Дата);	
	СуммаEUR=глПересчет(СуммаДокумента,Валюта,Курс,Евро,Дата); 	
	
	//ЗАТРАТЫ
	Движение=Движения.Затраты.Добавить();
	
	Движение.Период		=Дата;
	Движение.ВидДвижения=?(СуммаДокумента>0,ВидДвиженияНакопления.Расход,ВидДвиженияНакопления.Приход);
	Движение.Подразделение=Подразделение;
	Движение.СтатьяЗатрат=СтатьяЗатрат;
	//крохин начало
	Движение.СубЗатрата = СубЗатрата;
	//крохин конец
	Движение.СуммаУпр		=Модуль(СуммаРуб);		
	Движение.СуммаДокумента	=СуммаДокумента;
	Движение.ВалютаДокумента=Валюта;
	
	//крохин начало
	Движение.Комментарий        = Комментарий;
	//крохин конец
	
	//крохин начало 26.09.2013
	//проект
	Движение.Проект = Проект;
	//крохин конец 26.09.2013

	
	Если ТО.Итог("Остаток")<>КоличествоДокумента Тогда
		КоличествоДокумента=ТО.Итог("Остаток");	
		Записать();
	КонецЕсли;
	//крохин начало 13.04.2011
	//запишем ЦПП

	ЗаписиЦПП=РегистрыСведений.История.СоздатьНаборЗаписей();
	ЗаписиЦПП.Отбор.Документ.Использование	=Истина;
	ЗаписиЦПП.Отбор.Документ.Значение		=Ссылка;
	
	ЗаписиЦПП.Отбор.Реквизит.Использование	=Истина;
	ЗаписиЦПП.Отбор.Реквизит.Значение		="ЦенаПоследнегоПрихода";
	
	
	

	Для Каждого СтрокаТоваров Из Товары Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
		|	И НЕ Номенклатура.ЭтоГруппа";
		Запрос.УстановитьПараметр("Номенклатура",СтрокаТоваров.Номенклатура);
		ТаблицаНоменклатуры = Новый ТаблицаЗначений;
		ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТаблицыНоменклатуры ИЗ ТаблицаНоменклатуры Цикл
			
			ЗаписьЦПП=ЗаписиЦПП.Добавить();
			ЗаписьЦПП.Период	=Дата;
			ЗаписьЦПП.Реквизит	="ЦенаПоследнегоПрихода";
			ЗаписьЦПП.Объект	=СтрокаТаблицыНоменклатуры.Номенклатура;
			ЗаписьЦПП.Документ	=Ссылка;
			ЗаписьЦПП.Значение	=СтрокаТоваров.Цена;		
		КонецЦикла;
		
	КонецЦикла;
	ЗаписиЦПП.Записать();
	//крохин конец  13.04.2011
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
